{
  "name": "Green Hag",
  "size": "Medium",
  "type": "fey",
  "alignment": "neutral evil",
  "armorClass": 17,
  "armorType": "Natural Armor",
  "hitPoints": 82,
  "hitDice": "11d8 + 33",
  "speed": "30 ft.",
  "abilities": {
    "strength": 18,
    "dexterity": 12,
    "constitution": 16,
    "intelligence": 13,
    "wisdom": 14,
    "charisma": 14
  },
  "savingThrows": "",
  "skills": "Arcana +3, Deception +4, Perception +4, Stealth +3",
  "vulnerabilities": "",
  "resistances": "",
  "immunities": "",
  "conditionImmunities": "",
  "senses": "Darkvision 60 ft.,  Passive Perception 14",
  "languages": "Common, Draconic, Sylvan",
  "challenge": "3 (700 XP)",
  "proficiencyBonus": "+2",
  "specialAbilities": [
    {
      "name": "Amphibious",
      "uses": "",
      "description": "The hag can breathe air and water."
    },
    {
      "name": "Innate Spellcasting",
      "uses": "",
      "description": "The hag's innate spellcasting ability is Charisma (spell save DC 12). She can innately cast the following spells, requiring no material components:"
    },
    {
      "name": "Mimicry",
      "uses": "",
      "description": "The hag can mimic animal sounds and humanoid voices. A creature that hears the sounds can tell they are imitations with a successful DC 14 Wisdom (Insight) check."
    }
  ],
  "actions": [
    {
      "name": "Claws",
      "uses": "",
      "description": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage."
    },
    {
      "name": "Illusory Appearance",
      "uses": "",
      "description": "The hag covers herself and anything she is wearing or carrying with a magical illusion that makes her look like another creature of her general size and humanoid shape. The illusion ends if the hag takes a bonus action to end it or if she dies."
    },
    {
      "name": "The changes wrought by this effect fail to hold up to physical inspection",
      "uses": "",
      "description": "For example, the hag could appear to have smooth skin, but someone touching her would feel her rough flesh. Otherwise, a creature must take an action to visually inspect the illusion and succeed on a DC 20 Intelligence (Investigation) check to discern that the hag is disguised."
    },
    {
      "name": "Invisible Passage",
      "uses": "",
      "description": "The hag magically turns invisible until she attacks or casts a spell, or until her concentration ends (as if concentrating on a spell). While invisible, she leaves no physical evidence of her passage, so she can be tracked only by magic. Any equipment she wears or carries is invisible with her."
    }
  ],
  "legendaryActions": []
}