{
  "name": "Night Hag",
  "size": "Medium",
  "type": "fiend",
  "alignment": "neutral evil",
  "armorClass": 17,
  "armorType": "Natural Armor",
  "hitPoints": 112,
  "hitDice": "15d8 + 45",
  "speed": "30 ft.",
  "abilities": {
    "strength": 18,
    "dexterity": 15,
    "constitution": 16,
    "intelligence": 16,
    "wisdom": 14,
    "charisma": 16
  },
  "savingThrows": "",
  "skills": "Deception +7, Insight +6, Perception +6, Stealth +6",
  "vulnerabilities": "",
  "resistances": "Cold, Fire; Bludgeoning, Piercing, and Slashing from Nonmagical Attacks that aren't Silvered",
  "immunities": "",
  "conditionImmunities": "Charmed",
  "senses": "Darkvision 120 ft.,  Passive Perception 16",
  "languages": "Abyssal, Common, Infernal, Primordial",
  "challenge": "5 (1,800 XP)",
  "proficiencyBonus": "+3",
  "specialAbilities": [
    {
      "name": "Innate Spellcasting",
      "uses": "",
      "description": "The hag's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). She can innately cast the following spells, requiring no material components:"
    },
    {
      "name": "Magic Resistance",
      "uses": "",
      "description": "The hag has advantage on saving throws against spells and other magical effects."
    }
  ],
  "actions": [
    {
      "name": "Claws",
      "uses": "",
      "description": "(Hag Form Only). Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage."
    },
    {
      "name": "Change Shape",
      "uses": "",
      "description": "The hag magically polymorphs into a Small or Medium female humanoid, or back into her true form. Her statistics are the same in each form. Any equipment she is wearing or carrying isn't transformed. She reverts to her true form if she dies."
    },
    {
      "name": "Etherealness",
      "uses": "",
      "description": "The hag magically enters the Ethereal Plane from the Material Plane, or vice versa. To do so, the hag must have a heartstone in her possession."
    },
    {
      "name": "Nightmare Haunting",
      "uses": "1/Day",
      "description": "While on the Ethereal Plane, the hag magically touches a sleeping humanoid on the Material Plane. A protection from evil and good spell cast on the target prevents this contact, as does a magic circle. As long as the contact persists, the target has dreadful visions. If these visions last for at least 1 hour, the target gains no benefit from its rest, and its hit point maximum is reduced by 5 (1d10). If this effect reduces the target's hit point maximum to 0, the target dies, and if the target was evil, its soul is trapped in the hag's soul bag. The reduction to the target's hit point maximum lasts until removed by the greater restoration spell or similar magic."
    }
  ],
  "legendaryActions": []
}